results_595/sglang/minimax-m2.7/4k1k/logs/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc512_4k1k.log
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=None, ready_check_timeout_sec=0, dataset_name='random', dataset_path='', model='lukealonso/MiniMax-M2.7-NVFP4', served_model_name=None, tokenizer=None, num_prompts=5120, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=512, output_file='/results/sglang/minimax-m2.7/4k1k/json/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc512_4k1k.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=30000, ready_check_timeout_sec=0, dataset_name='random', dataset_path='', model='lukealonso/MiniMax-M2.7-NVFP4', served_model_name=None, tokenizer=None, num_prompts=5120, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=512, output_file='/results/sglang/minimax-m2.7/4k1k/json/MiniMax-M2.7-NVFP4_nvfp4_sglang_tp8_conc512_4k1k.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 20971520
#Output tokens: 5242880
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 5120/5120 [13:57<00:00,  6.11it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    inf       
Max request concurrency:                 512       
Successful requests:                     5120      
Benchmark duration (s):                  837.77    
Total input tokens:                      20971520  
Total input text tokens:                 20971520  
Total generated tokens:                  5242880   
Total generated tokens (retokenized):    4916685   
Request throughput (req/s):              6.11      
Input token throughput (tok/s):          25032.48  
Output token throughput (tok/s):         6258.12   
Peak output token throughput (tok/s):    16383.00  
Peak concurrent requests:                1024      
Total token throughput (tok/s):          31290.60  
Concurrency:                             510.81    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   83583.11  
Median E2E Latency (ms):                 83693.24  
P90 E2E Latency (ms):                    84187.86  
P99 E2E Latency (ms):                    84978.52  
---------------Time to First Token----------------
Mean TTFT (ms):                          19471.17  
Median TTFT (ms):                        19237.32  
P99 TTFT (ms):                           37255.63  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.67     
Median TPOT (ms):                        63.00     
P99 TPOT (ms):                           77.74     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           66.95     
Median ITL (ms):                         37.28     
P95 ITL (ms):                            83.25     
P99 ITL (ms):                            332.64    
Max ITL (ms):                            32970.55  
==================================================